import erajs.api as a
from funcs import debug

def character_upgrade_page(c):
    a.page()
    a.mode('grid',5)
    a.divider()
    for i in c['开发']:
        able_upgrade_requirement = False
        style = {}
        if i in upgrade_requirement:
            able_upgrade_requirement = True
            if check_upgrade_requirement(c,i):
                style = {'color':'#FFC1C1'}
        else:
            able_upgrade_requirement = False
        a.button('[{}]:Lv{}'.format(i,c['开发'][i]),a.goto,show_requirement,c,i,disabled=not able_upgrade_requirement,style= style)
        a.t()
    a.divider()
    a.mode()
    a.b('返回',a.back)
    a.cfg()['debug'] = True
    debug()

#检查人物某一项开发度是否达到升级条件
def check_upgrade_requirement(c,subject):
    level = c['开发'][subject]
    can_upgrade = False
    if level == 5:
        return False
    else:
        requirement = upgrade_requirement[subject][level+1]
        for i in requirement:
            f = True
            for j in i:
                if j in c['经验']:#经验类
                    if c['经验'][j]>=i[j]:pass
                    else:
                        f = False
                if j+'记忆' in c['记忆']:#记忆类
                    if c['记忆'][j+'记忆']>=i[j]:pass
                    else:
                        f = False
                if j in c['刻印']:
                    if c['刻印'][j]>=i[j]:pass
                    else:
                        f = False
                if j in c['开发']:
                    if c['开发'][j]>=i[j]:pass
                    else:
                        f = False
            can_upgrade = can_upgrade or f
    return can_upgrade

#显示各条升级条件
def show_requirement(c,subject):
    level = c['开发'][subject]
    can_upgrade = False
    a.page()
    a.t('开发需求')
    a.t()
    if level == 5:
        a.t('已升至最大等级')
    else:
        requirement = upgrade_requirement[subject][level+1]
        for i in requirement:
            a.divider()
            a.mode('grid',5)
            f = True
            for j in i:
                if j in c['经验']:#经验类
                    if c['经验'][j]>=i[j]:
                        a.t('{}:当前{},需要{};'.format(j,c['经验'][j],i[j]), style = {'color':'#0f0'})
                    else:
                        a.t('{}:当前{},需要{};'.format(j,c['经验'][j],i[j]), style = {'color':'#778899'})
                        f = False
                if j+'记忆' in c['记忆']:#记忆类
                    if c['记忆'][j+'记忆']>=i[j]:
                        a.t('{}:当前{},需要{};'.format(j+'记忆',c['记忆'][j+'记忆'],i[j]), style = {'color':'#0f0'})
                    else:
                        a.t('{}:当前{},需要{};'.format(j+'记忆',c['记忆'][j+'记忆'],i[j]), style = {'color':'#778899'})
                        f = False
                if j in c['刻印']:
                    if c['刻印'][j]>=i[j]:
                        a.t('{}:当前{},需要{};'.format(j,c['刻印'][j],i[j]), style = {'color':'#0f0'})
                    else:
                        a.t('{}:当前{},需要{};'.format(j,c['刻印'][j],i[j]), style = {'color':'#778899'})
                        f = False
                if j in c['开发']:
                    if c['开发'][j]>=i[j]:
                        a.t('{}:当前{},需要{};'.format(j,c['开发'][j],i[j]), style = {'color':'#0f0'})
                    else:
                        a.t('{}:当前{},需要{};'.format(j,c['开发'][j],i[j]), style = {'color':'#778899'})
                        f = False
                a.t()
            can_upgrade = can_upgrade or f
            if f:
                a.b('可升级',upgrade,c,subject,i,style = {'color':'#ff0'})
            a.t()
    a.divider()
    a.b('返回',a.back)

def upgrade(c,subject,requirement):
    for i in requirement:
        if i+'记忆' in c['记忆']:
            c['记忆'][i+'记忆'] -= requirement[i]
    c['开发'][subject] += 1
    a.repeat()

upgrade_requirement = {
    'C感觉':{
        1:[{'快C':10}],
        2:[{'快C':100,'C经验':5}],
        3:[{'快C':3000,'C经验':20}],
        4:[{'快C':10000,'C经验':100}],
        5:[{'快C':50000,'C经验':200}],
    },
    'B感觉':{
        1:[{'快B':10}],
        2:[{'快B':100,'B经验':5}],
        3:[{'快B':3000,'B经验':20}],
        4:[{'快B':10000,'B经验':100}],
        5:[{'快B':50000,'B经验':200}],
    },
    'V感觉':{
        1:[{'快V':10}],
        2:[{'快V':100,'V经验':5}],
        3:[{'快V':3000,'V经验':20}],
        4:[{'快V':10000,'V经验':100}],
        5:[{'快V':50000,'V经验':200}],
    },
    'A感觉':{
        1:[{'快A':10}],
        2:[{'快A':100,'A经验':5}],
        3:[{'快A':3000,'A经验':20}],
        4:[{'快A':10000,'A经验':100}],
        5:[{'快A':50000,'A经验':200}],
    },
    'M感觉':{
        1:[{'快M':10}],
        2:[{'快M':100,'M经验':5}],
        3:[{'快M':3000,'M经验':20}],
        4:[{'快M':10000,'M经验':100}],
        5:[{'快M':50000,'M经验':200}],
    },
    'U感觉':{
        1:[{'快U':10}],
        2:[{'快U':100,'U经验':5}],
        3:[{'快U':3000,'U经验':20}],
        4:[{'快U':10000,'U经验':100}],
        5:[{'快U':50000,'U经验':200}],
    },
    'W感觉':{
        1:[{'快W':10}],
        2:[{'快W':100,'W经验':5}],
        3:[{'快W':3000,'W经验':20}],
        4:[{'快W':10000,'W经验':100}],
        5:[{'快W':50000,'W经验':200}],
    },
    '服从':{
        1:[{'恭顺':50,'屈服':10},{'恐惧':50,'苦痛':100},{'屈服':50,'药物成瘾':1}],
        2:[{'恭顺':200,'屈服':500},{'恐惧':500,'苦痛':1000,'屈服':100},{'屈服':500,'药物成瘾':1}],
        3:[{'恭顺':1000,'屈服':3000},{'恐惧':5000,'苦痛':10000,'屈服':300},{'药毒':1000,'药物成瘾':2}],
        4:[{'恭顺':10000,'屈服':6000},{'恐惧':30000,'苦痛':80000,'屈服':1000},{'药毒':5000,'药物成瘾':2}],
        5:[{'恭顺':10000,'屈服':6000},{'恐惧':30000,'苦痛':80000,'屈服':5000},{'药毒':10000,'药物成瘾':3}],
    },
    '欲望':{
        1:[{'欲情':50}],
        2:[{'欲情':200,'屈服':10,'绝顶经验':1}],
        3:[{'欲情':1000,'屈服':500,'绝顶经验':10,'快乐刻印':1}],
        4:[{'欲情':10000,'屈服':3000,'绝顶经验':200,'快乐刻印':2}],
        5:[{'欲情':10000,'屈服':6000,'绝顶经验':500,'快乐刻印':3}],
    },
    '侍奉欲望':{
        1:[{'欲望':1,'服从':1,'侍奉快乐':10}],
        2:[{'欲望':2,'服从':2,'侍奉快乐':50}],
        3:[{'欲望':3,'服从':3,'侍奉快乐':100}],
        4:[{'恭顺':5000,'侍奉快乐':500,'侍奉经验':100}],
        5:[{'恭顺':10000,'侍奉快乐':1000,'侍奉经验':200}],
    },
    'V名器度':{
        1:[{'V经验':10}],
        2:[{'V经验':50,'欲望':1,'腰技':1}],
        3:[{'V经验':200,'欲望':2,'腰技':2}],
        4:[{'V经验':500,'欲望':3,'侍奉欲望':2,'腰技':2,'腔射经验':20,'腔内储精经验':10}],
        5:[{'V经验':1000,'欲望':3,'侍奉欲望':3,'腰技':3,'腔射经验':50,'腔内储精经验':50}],
    },
    'A名器度':{
        1:[{'A经验':10}],
        2:[{'A经验':50,'欲望':1,'腰技':1}],
        3:[{'A经验':200,'欲望':2,'腰技':2}],
        4:[{'A经验':500,'欲望':3,'侍奉欲望':2,'腰技':2,'肛射经验':20,'精液灌肠经验':10}],
        5:[{'A经验':1000,'欲望':3,'侍奉欲望':3,'腰技':3,'肛射经验':50,'精液灌肠经验':50}],
    },
    '喉名器度':{
        1:[{'口交经验':10}],
        2:[{'口交经验':50,'深喉经验':1,'欲望':1,'舌技':1}],
        3:[{'口交经验':200,'深喉经验':10,'欲望':2,'舌技':2,'饮精经验':1}],
        4:[{'口交经验':500,'深喉经验':50,'欲望':3,'侍奉欲望':2,'舌技':2,'饮精经验':50}],
        5:[{'口交经验':1000,'深喉经验':100,'欲望':3,'侍奉欲望':3,'舌技':3,'饮精经验':100}],
    },
    '尿道名器度':{
        1:[{'尿道扩张度':3}],
        2:[{'U经验':50,'欲望':1,'腰技':1}],
        3:[{'U经验':200,'欲望':2,'腰技':2}],
        4:[{'U经验':500,'欲望':3,'侍奉欲望':2,'腰技':2}],
        5:[{'U经验':1000,'欲望':3,'侍奉欲望':3,'腰技':3}],
    },
    'V扩张度':{    #VA尿道扩张采用不同的算法
        1:[{'V经验':1}],
        2:[{'V经验':1,'V扩张经验':10}],
        3:[{'V经验':1,'V扩张经验':10}],
        4:[{'V经验':1,'V扩张经验':10}],
        5:[{'V经验':1,'V扩张经验':10}],
    },
    '指技':{
        1:[{'习得':10,'指技经验':5}],
        2:[{'习得':100,'指技经验':25}],
        3:[{'习得':1000,'指技经验':100}],
        4:[{'习得':5000,'指技经验':200}],
        5:[{'习得':10000,'指技经验':500}],
    },
    '腰技':{
        1:[{'习得':10,'腰技经验':5}],
        2:[{'习得':100,'腰技经验':25}],
        3:[{'习得':1000,'腰技经验':100}],
        4:[{'习得':5000,'腰技经验':200}],
        5:[{'习得':10000,'腰技经验':500}],
    },
    '舌技':{
        1:[{'习得':10,'舌技经验':5}],
        2:[{'习得':100,'舌技经验':25}],
        3:[{'习得':1000,'舌技经验':100}],
        4:[{'习得':5000,'舌技经验':200}],
        5:[{'习得':10000,'舌技经验':500}],
    },
    '足技':{
        1:[{'习得':10,'足技经验':5}],
        2:[{'习得':100,'足技经验':25}],
        3:[{'习得':1000,'足技经验':100}],
        4:[{'习得':5000,'足技经验':200}],
        5:[{'习得':10000,'足技经验':500}],
    },
    '魔乳':{
        1:[{'习得':10,'魔乳经验':5}],
        2:[{'习得':100,'魔乳经验':25}],
        3:[{'习得':1000,'魔乳经验':100}],
        4:[{'习得':5000,'魔乳经验':200}],
        5:[{'习得':10000,'魔乳经验':500}],
    },
    '露出癖':{
        1:[{'羞耻':10}],
        2:[{'羞耻':500,'露出经验':5}],
        3:[{'羞耻':5000,'露出经验':50}],
        4:[{'羞耻':10000,'露出经验':100}],
        5:[{'羞耻':50000,'露出经验':500}],
    },
    'S属性':{
        1:[{'主导':10,'施虐快乐经验':1}],
        2:[{'主导':50,'施虐快乐经验':5}],
        3:[{'主导':500,'施虐快乐经验':20}],
        4:[{'主导':5000,'施虐快乐经验':100}],
        5:[{'主导':10000,'施虐快乐经验':500}],
    },
    'M属性':{
        1:[{'苦痛':10,'被虐快乐经验':1}],
        2:[{'苦痛':50,'被虐快乐经验':5}],
        3:[{'苦痛':500,'被虐快乐经验':20}],
        4:[{'苦痛':5000,'被虐快乐经验':100}],
        5:[{'苦痛':10000,'被虐快乐经验':500}],
    },
    '百合中毒':{
        1:[{'百合经验':1}],
        2:[{'百合经验':10}],
        3:[{'百合经验':30}],
        4:[{'百合经验':60}],
        5:[{'百合经验':150}],
    },
    '男同中毒':{
        1:[{'男同经验':1}],
        2:[{'男同经验':10}],
        3:[{'男同经验':30}],
        4:[{'男同经验':60}],
        5:[{'男同经验':150}],
    },
    '喷乳中毒':{
        1:[{'喷乳经验':10,'欲望':2}],
        2:[{'喷乳经验':50,'欲望':2}],
        3:[{'喷乳经验':100,'欲望':3}],
        4:[{'喷乳经验':500,'欲望':4}],
        5:[{'喷乳经验':1000,'欲望':5}],
    },
    '射精中毒':{
        1:[{'射精经验':10,'欲望':2}],
        2:[{'射精经验':50,'欲望':2}],
        3:[{'射精经验':100,'欲望':3}],
        4:[{'射精经验':500,'欲望':4}],
        5:[{'射精经验':1000,'欲望':5}],
    },
    '精液成瘾':{
        1:[{'精液经验':10,'欲望':2}],
        2:[{'精液经验':50,'欲望':2}],
        3:[{'精液经验':100,'欲望':3,'饮精经验':5}],
        4:[{'精液经验':500,'欲望':4,'饮精经验':30}],
        5:[{'精液经验':1000,'欲望':5,'饮精经验':100}],
    },
    '自慰成瘾':{
        1:[{'自慰经验':10,'欲望':2}],
        2:[{'自慰经验':50,'欲望':2}],
        3:[{'自慰经验':100,'欲望':3,'饮精经验':5}],
        4:[{'自慰经验':500,'欲望':4,'饮精经验':30}],
        5:[{'自慰经验':1000,'欲望':5,'饮精经验':100}],
    },
    '药物成瘾':{
        1:[{'药毒':100}],
        2:[{'药毒':1000}],
        3:[{'药毒':5000}],
        4:[{'药毒':10000,'药毒刻印':2}],
        5:[{'药毒':100000,'药毒刻印':3}],
    },
    '被射中毒':{
        1:[{'腔射经验':10},{'肛射经验':10}],
        2:[{'腔射经验':30,'精液成瘾':2},{'肛射经验':30,'精液成瘾':2}],
        3:[{'腔射经验':70,'精液成瘾':3},{'肛射经验':70,'精液成瘾':3}],
        4:[{'腔射经验':200,'精液成瘾':4,'欲望':3},{'肛射经验':200,'精液成瘾':4,'欲望':3}],
        5:[{'腔射经验':1000,'精液成瘾':5},{'肛射经验':1000,'精液成瘾':5}],
    },
    '排泄成瘾':{
        1:[{'排泄经验':10},{'漏尿经验':10}],
        2:[{'排泄经验':30,'露出癖':2},{'漏尿经验':30,'露出癖':2}],
        3:[{'排泄经验':70,'露出癖':3},{'漏尿经验':70,'露出癖':3}],
        4:[{'排泄经验':200,'露出癖':4,'欲望':3},{'漏尿经验':200,'露出癖':4,'欲望':3}],
        5:[{'排泄经验':1000,'露出癖':5},{'漏尿经验':1000,'露出癖':5}],
    },
    '触手适性':{
        1:[{'触手经验':5}],
        2:[{'同化':10,'触手经验':20}],
        3:[{'同化':100,'触手经验':50}],
        4:[{'同化':2000,'触手经验':100}],
        5:[{'同化':10000,'触手经验':300}],
    },
    '兽交中毒':{
        1:[{'兽奸经验':5}],
        2:[{'欲望':1,'兽奸经验':20}],
        3:[{'欲望':2,'兽奸经验':50}],
        4:[{'欲望':3,'兽奸经验':100}],
        5:[{'欲望':4,'兽奸经验':300}],
    },
    '受孕成瘾':{
        1:[{'受孕经验':1}],
        2:[{'欲望':1,'受孕经验':2}],
        3:[{'欲望':2,'受孕经验':5}],
        4:[{'欲望':3,'受孕经验':10}],
        5:[{'欲望':4,'受孕经验':20}],
    }

}